def actor(a,b):
    adict={**a,**b} #字典合并
    print("刘昊然饰演的是：",adict['刘昊然'])
    print("江疏影有事不能参加本次拍摄，更替为张静初")
    del adict['江疏影']
    adict.update({'张静初':'宫羽衣'})
    print(adict)
    adict1={"宣言":"白鹿颜", "魏千翔": "百里宁卿_姜广涛", "刘冠成": "拓跋山月_杨默", "江涛":"翼天瞻", "董勇":"吕嵩", "杨新鸣":"大合萨_郭正建"}
    adict2={"张智尧":"白毅_宝木中阳", "陈昊宇":"小舟公主", "杨玏": "吕鹰扬", "吴佳怡": "嬴玉"}
    adict={**adict,**adict1,**adict2}
    print("所有演员及角色：")
    print(adict)
    print("一共有",len(adict),"个角色")
dict1 = {"刘昊然": "吕归尘", "宋祖儿": "羽然", "陈若轩": "姬野_许凯", "张志坚":"雷碧城", "李光洁": "息衍", "许晴": "白凌波"}
dict2 = {"江疏影":"宫羽衣_韩啸","王鸥":"苏瞬卿","张丰毅":"嬴无翳_宣晓明","张嘉译":"百里景洪"}
actor(dict1,dict2)
